[{"species":"dog","intakeDate":"2015-11-03T05:00:00.000Z","Available":true,"petName":"Ares","image":"151103_ares.jpg","images":["151103_ares.jpg"],"description":"Ares got his happy new forever home and is loving his new big screened in porch. He enjoys bird watching all day long!","notes":""},{"species":"dog","intakeDate":"2015-11-03T05:00:00.000Z","Available":true,"petName":"Callie","image":"151103_callie.jpg","images":["151103_callie.jpg"],"description":"Callie was adopted today and she is now enjoying being spoiled!","notes":""},{"species":"dog","intakeDate":"2015-11-03T05:00:00.000Z","petName":"Chole","image":"151103_chole.jpg","images":["151103_chole.jpg"],"description":"This is Chloe. Chloe is a 2 year old, spayed female, Chihuahua. Chloe is very playful and very social. She loves to run and play with other dogs too. She is fully vetted and crate trained. Chloe is also a kisser! If you are interested in meeting this sweet angel, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-03T05:00:00.000Z","petName":"Trixie","image":"151103_trixie.jpg","images":["151103_trixie.jpg"],"description":"This is Trixie. Trixie is a 1 year old, spayed female, DSH, Dilute Tortie. Trixie is very active and loves to eat. She is fully vetted and great with other cats. She loves to chase lizards and bugs too. If you are interested in meeting this pretty girl, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-13T05:00:00.000Z","Available":true,"petName":"Sissy","image":"151111_sissy.jpg","images":["151111_sissy.jpg"],"description":"Sissy was adopted and now she is getting all the attention and affection she deserves!","notes":""},{"species":"dog","intakeDate":"2015-11-16T05:00:00.000Z","Available":true,"petName":"Dexter","image":"151116_dex.jpg","images":["151116_dex.jpg"],"description":"Dexter now has a new family and he is enjoying all the attention! Congratulations Dexter.","notes":""},{"species":"dog","intakeDate":"2015-11-16T05:00:00.000Z","Available":true,"petName":"TJ","image":"151116_tj.jpg","images":["151116_tj.jpg"],"description":"TJ found his new home and now he is being SPOILED ROTTEN!","notes":""},{"species":"dog","intakeDate":"2015-11-16T05:00:00.000Z","Available":true,"petName":"Jimmy","image":"151116_jimmy.jpg","images":["151116_jimmy.jpg"],"description":"Congrats Jimmy! Jimmy found his new home and his new family at the Shop Lady Lake Expo!","notes":""},{"species":"dog","intakeDate":"2015-11-16T05:00:00.000Z","Available":true,"petName":"Snickerdoodle","image":"151116_snickerdoodle.jpg","images":["151116_snickerdoodle.jpg"],"description":"Snickerdoodle was adopted and now she is getting all the attention she deserves! Congratulations, sweet girl.","notes":""},{"species":"dog","intakeDate":"2015-11-15T05:00:00.000Z","petName":"Turbo","image":"151115_turbo.jpg","images":["151115_turbo.jpg"],"description":"This is Turbo. Turbo is a 3-4 year old, neutered male, Terrier mix. He is very shy at first but he comes around quickly and he is great with other dogs. He is fully vetted and crate trained too. He is only 24 lbs! If you are interested in meeting this sweetheart, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-15T05:00:00.000Z","petName":"Star","image":"151115_star.jpg","images":["151115_star.jpg"],"description":"This is Star. Star is a 2 year old, spayed female, Terrier mix. She is very sweet and she loves to give kisses. She is housebroken and fully vetted. Star is good with other dogs and kids too. She is just under 30 lbs! Star also knows basic commands and is obedient. If your interested in meeting this cutie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530. ","notes":""},{"species":"dog","intakeDate":"2015-11-15T05:00:00.000Z","petName":"Ranger","image":"151115_ranger.jpg","images":["151115_ranger.jpg"],"description":"This is Ranger. Ranger is a 7 year old, neutered male, German Shepherd. He is very affectionate and he is a kisser! He is housebroken. He is fully vetted and good with other dogs too. He also plays fetch and he is very gentle. If you are interested in meeting this precious baby, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530. ","notes":""},{"species":"dog","intakeDate":"2015-11-15T05:00:00.000Z","petName":"Maggie","image":"151115_maggie.jpg","images":["151115_maggie.jpg"],"description":"This is Maggie. Maggie is a 4-5 year old, Spayed Female, GSD Chow Mix. Maggie is very playful and very social. She loves to run and play with other dogs too. She is fully vetted and Housebroken! If you are interested in meeting this sweet girl, Please contact your Local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-15T05:00:00.000Z","petName":"Figaro","image":"151115_figaro.jpg","images":["151115_figaro.jpg"],"description":"This is Figaro. Figaro is a 2 year old, neutered male, DMH. Figaro is very loving and affectionate, but he is also very playful. He is fully vetted and good with other cats too. Chasing bugs and lizards is his favorite pastime. There is never a dull moment when Figaro is around. If you are interested in meeting this frisky kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-19T05:00:00.000Z","Available":true,"petName":"Zoey","image":"151119_zoey.jpg","images":["151119_zoey.jpg"],"description":"Zoey found her new home and now she has a brand new bed and big fenced in yard to play!","notes":""},{"species":"dog","intakeDate":"2015-11-25T05:00:00.000Z","Available":true,"petName":"Charlie","image":"151125_charlie.jpg","images":["151125_charlie.jpg"],"description":"Congratulations Charlie! He is adopted and now he has a new home for the holidays.","notes":""},{"species":"dog","intakeDate":"2015-12-31T05:00:00.000Z","petName":"Simon","image":"151231_simon.jpg","images":["151231_simon.jpg"],"description":"This is Simon. Simon is a 3 year old, neutered male, Long Haired Flame Point Saimese. Simon is very affectionate and he loves getting all the attention. He enjoys lounging around and taking cat naps. He is fully vetted and good with other cats too. Simon is also microchipped. If you are interested in meeting this cutie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Teddy","image":"151130_teddy.jpg","images":["151130_teddy.jpg"],"description":"This is Teddy. Teddy is a 1-2 year old, neutered male, DMH Mainecoon mix. Teddy is huggable and lovable. He loves being held and cuddled. He is fully vetted and good with other cats too. If you are interested in meeting this charming boy, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Titan","image":"151130_titan.jpg","images":["151130_titan.jpg"],"description":"This is Titan. Titan is a 3 year old, neutered male, Flame Point Siamese. Titan is a hefty boy and he likes to eat. He is also very sweet and and he enjoys being scratched behind his ears. He is fully vetted and good with other cats too. If you are interested in meeting this big sweetheart, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Kiara","image":"151130_kiara.jpg","images":["151130_kiara.jpg"],"description":"This is Kiara. Kiara is a 5-7 year old, spayed female, DLH, Tortie. Kiara is very quiet and mellow. She enjoys sitting on window seals and bird watching.  She also enjoys long naps and warm blankets. She is fully vetted and good with other cats too. If you are interested in meeting this lovable kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Maple","image":"151130_maple.jpg","images":["151130_maple.jpg"],"description":"This is Maple. Maple is a 1 year old, spayed female, DLH, Tortie. Maple is a very petite kitty. Weighing only about 5 lbs, She is pocket size! What a beauty! She is also very quiet. She is fully vetted and good with other cats too. If you are interested in meeting this dainty diva, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Bionce","image":"151130_bionce.jpg","images":["151130_bionce.jpg"],"description":"This is Bionce. Bionce is a 4 month old, spayed female, DMH. Bionce is frisky and comical. She loves to frolic and play. She loves playing hide & seek with her littermates too. She is fully vetted and good with other cats too. She is also microchipped. If you are interested in meeting this frisky kitten, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Candice","image":"151130_candice.jpg","images":["151130_candice.jpg"],"description":"This is Candice. Candice is a 4 month old, spayed female, DMH. Candice is a very friendly and cheerful kitten. She loves to run and play with her siblings. She is fully vetted and good with other cats too. She is also microchipped. If you are interested in meeting this sweet baby, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-11-30T05:00:00.000Z","petName":"Tristin","image":"151130_tristin.jpg","images":["151130_tristin.jpg"],"description":"This is Tristin. Tristin is a 4 month old, neutered male, DMH. Tristin is a very friendly and playful kitten. He loves to climb and chase string. He is fully vetted and good with other cats too. He is also microchipped. If you are interested in meeting this playful kitten, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-01T05:00:00.000Z","petName":"Sara","image":"151201_sara.jpg","images":["151201_sara.jpg"],"description":"This is Sara. Sara is a 2 year old, spayed female, Australian Cattle Dog. Sara is very energetic and she loves to run and play fetch. She is a frisbee fanatic! She is good with most other dogs but not cats. She is fully vetted and housebroken too! She also knows basic commands. If you are interested in meeting this tail-wagging frisbee-catching pup, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-31T05:00:00.000Z","petName":"Liberty","image":"151231_liberty.jpg","images":["151231_liberty.jpg"],"description":"This is Liberty. Liberty is a 3-4 year old, spayed female, DMH. Liberty is a very loving and affectionate Kitty. She enjoys sunbathing and snuggling on warm & cozy laps. She is fully vetted and good with other cats too. She is also microchipped and she has extra toes too! If you are interested in meeting this darling, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-03T05:00:00.000Z","petName":"Maverick","image":"151203_maverick.jpg","images":["151203_maverick.jpg"],"description":"This is Maverick. Maverick is a 3-4 year old, male, Basset Griffon Vendeen mix. Maverick is very sweet & affectionate. He loves belly rubs and he is good with other dogs too. He is also crate trained! If you are interested in meeting this adorable cutie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-08T05:00:00.000Z","petName":"Katie","image":"151208_katie.jpg","images":["151208_katie.jpg"],"description":"This is Katie. Katie is a 1-2 year old, spayed female, DMH Blue Russian mix. Katie is a cuddle bug! She is very quiet and mellow. She enjoys bird watching and being held. She is fully vetted and good with other cats too. She is looking for her new home and someone to love her. If you are interested in meeting this cuddle bug, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-08T05:00:00.000Z","petName":"Kiki","image":"151208_kiki.jpg","images":["151208_kiki.jpg"],"description":"This is Kiki. Kiki is a 1 year old, spayed female, Lynx Point Siamese. Kiki loves attention but also likes spending time chasing toys & string. She is fully vetted and good with other cats too. And she has the most gorgeous blue eyes! If you are interested in meeting this beautiful kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-08T05:00:00.000Z","petName":"AJ","image":"151208_aj.jpg","images":["151208_aj.jpg"],"description":"This is A.J. A.J. is a 2 year old, neutered male, DSH. A.J. is very affectionate but is also very playful. He is fully vetted and good with other cats too. He enjoys chasing lizards or anything that moves! And he has an adorable bobtail! If you are interested in meeting this frisky kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-08T05:00:00.000Z","petName":"Shelby","image":"151208_shelby.jpg","images":["151208_shelby.jpg"],"description":"This is Shelby. Shelby is a 2 year old, spayed female, DMH Blue Russian mix. Shelby is a sweetheart and she loves other cats too. She is very petite and weighs only about 5 lbs. She is fully vetted and she is looking for a fur-ever home for the holidays! If you are interested in meeting this sweetie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-14T05:00:00.000Z","Available":true,"petName":"Luna","image":"151214_luna.jpg","images":["151214_luna.jpg"],"description":"Yea! Luna was adopted. Wishing her and her new family a very Merry Christmas and a Happy New Year!","notes":""},{"species":"dog","intakeDate":"2015-12-14T05:00:00.000Z","petName":"Lola","image":"151214_lola.jpg","images":["151214_lola.jpg"],"description":"This is Lola. Lola is a 1-2 year old, spayed female, Lynx Point Siamese. Lola is very sweet but shy at first. She is very quiet and easy-going. And she has the most beautiful blue eyes! She is fully vetted and she is looking for a fur-ever home for the holidays! If you are interested in meeting this beautiful kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-14T05:00:00.000Z","petName":"Josie","image":"151214_josie.jpg","images":["151214_josie.jpg"],"description":"This is Josie. Josie is a 2 year old, spayed female, DMH Calico. Josie loves attention and she will follow you anywhere to get it. She also likes spending time chasing toys & string. She is fully vetted and good with other cats too. She is very petite and only weighs about 5 lbs. If you are interested in meeting this sweetie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-14T05:00:00.000Z","petName":"Kitty","image":"151214_kitty.jpg","images":["151214_kitty.jpg"],"description":"This is Kitty. Kitty is a 3 year old, spayed female, chocolate saimese mix. Kitty is a cuddle bug! She is very quiet and mellow. She enjoys bird watching and being held. She is fully vetted and good with other cats too. She is looking for her new home and someone to love her. If you are interested in meeting this cuddle bug, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-14T05:00:00.000Z","petName":"Inkie","image":"151214_inkie.jpg","images":["151214_inkie.jpg"],"description":"This is Inkie. Inkie is a 2-3 year old, neutered male, DSH. Inkie is very affectionate but he is also very playful. He is fully vetted and good with other cats too. He enjoys chasing lizards or anything that moves! And he has an adorable bobtail! If you are interested in meeting this frisky kitty, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2015-12-23T05:00:00.000Z","Available":true,"petName":"Dexter","image":"151223_dexter.jpg","images":["151223_dexter.jpg"],"description":"Dexter now has a new family and he is enjoying all the attention. Congratulations Dexter!","notes":""},{"species":"dog","intakeDate":"2015-12-23T05:00:00.000Z","Available":true,"petName":"TJ","image":"151223_tj.jpg","images":["151223_tj.jpg"],"description":"TJ found his new home and now he is being spoiled rotten!","notes":""},{"species":"dog","intakeDate":"2015-12-23T05:00:00.000Z","Available":true,"petName":"Ryder","image":"151223_ryder.jpg","images":["151223_ryder.jpg"],"description":"Ryder was adopted and now he has a whole family to love and play with him, including both 2 and 4 legged friends. Congratulations Ryder!","notes":""},{"species":"dog","intakeDate":"2015-12-27T05:00:00.000Z","Available":true,"petName":"Teddy","image":"151227_teddy.jpg","images":["151227_teddy.jpg"],"description":"Teddy found his new home and now he is being spoiled rotten!","notes":""},{"species":"dog","intakeDate":"2015-12-27T05:00:00.000Z","Available":true,"petName":"Tebow","image":"151227_tebow.jpg","images":["151227_tebow.jpg"],"description":"Tebow was adopted! And now has a new family and he is getting tons of attention! ","notes":""},{"species":"dog","intakeDate":"2015-12-27T05:00:00.000Z","petName":"Grayson","image":"151227_grayson.jpg","images":["151227_grayson.jpg"],"description":"This is Grayson. Grayson is a 6 month old, neutered male, DSH. Grayson is very affectionate but is also very playful. He is fully vetted and good with other cats too. He enjoys chasing lizards & toys or anything that moves! If you are interested in meeting this frisky kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-04T05:00:00.000Z","petName":"Montana","image":"160104_montana.jpg","images":["160104_montana.jpg"],"description":"This is Montana. Montana is a 3-4 year old, neutered male, Flame Point Siamese. He is a darling, very affectionate and loving. He is also good with other cats. He would love to snuggle with someone and he loves to gives hugs. He is current on vaccines and he is a TALKER too. If your interested in possible giving this irresistibly lovable kitty a new furever home, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-04T05:00:00.000Z","petName":"Maisie","image":"160104_maisie.jpg","images":["160104_maisie.jpg"],"description":"This is Maisie. Maisie is a 6 month old, spayed female, DMH kitten. Maisie is the best bug catcher ever and she will find ways to entertain herself if you don't have time to play. This sweet girl is spunky, fully vetted and microchipped. If you are interested in meeting this cutie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-04T05:00:00.000Z","petName":"Sofie","image":"160104_sofie.jpg","images":["160104_sofie.jpg"],"description":"This is Sofie. Sofie is a 6 month old, spayed female, DMH kitten. Sofie loves attention and she will follow you anywhere to get it. She also likes spending time chasing toys & string. She is fully vetted and good with other cats too. If you are interested in meeting this sweetie pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-04T05:00:00.000Z","petName":"Emma","image":"160104_emma.jpg","images":["160104_emma.jpg"],"description":"This is Emma. Emma is a 3 year old, spayed female, Lynx Point Siamese. Emma is a cuddle bug! She is very quiet and mellow. She enjoys bird watching and being held. She is fully vetted and has beautiful blue eyes! She is looking for her new furever home and someone to love her. If you are interested in meeting this cuddle bug, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-08T05:00:00.000Z","petName":"Mabel","image":"160108_mable.jpg","images":["160108_mable.jpg"],"description":"This is Mabel. Mabel is a 1 year old, spayed female, Terrier mix. Mabel is spunky and she loves to run and play. She is great with other dogs and there is never a dull moment when she is around. Mabel is fully vetted and heartworm negative! If you are interested in meeting this sweet angel, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-11T05:00:00.000Z","petName":"Merlin","image":"160111_merlin.jpg","images":["160111_merlin.jpg"],"description":"This is Merlin. Merlin is a 4 year old, neutered male, DLH Mainecoon Mix. Merlin is quiet and laid-back. He enjoys snuggling in a warm bed and basking in the sun. He is good with other cats and fully vetted. Merlin is also microchipped! If you are interested in meeting this fluffy feline, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-12T05:00:00.000Z","petName":"Garfield","image":"160112_garfield.jpg","images":["160112_garfield.jpg"],"description":"Meet a real life Garfield! Garfield is a 3 year old, neutered male DSH orange Tiger. Garfield is very loving and a happy boy at 20 lbs! He is good with other cats and he loves giving hugs. He enjoys lounging around and taking cat naps. He is fully vetted and looking for his new home. If you are interested in meeting this hefty boy, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-12T05:00:00.000Z","Available":true,"petName":"Mable","image":"160112_mable.jpg","images":["160112_mable.jpg"],"description":"Congratulations Mabel! She was adopted and now she has a warm home and comfy lap to snuggle on!","notes":""},{"species":"dog","intakeDate":"2016-01-13T05:00:00.000Z","petName":"Mickey","image":"160113_mickey.jpg","images":["160113_mickey.jpg"],"description":"This is Mickey. Mickey is a 2 year old, neutered male, Chihuahua. Mickey is shy at first and takes a little time to warm up to new people, but with a little patience & time, Mickey becomes a cuddle bug. He likes to be held and snuggled. He is also good with other dogs. Mickey is fully vetted and microchipped. He is just under 10 lbs! If you are interested in possibly giving this pocket-sized pet his new home, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-19T05:00:00.000Z","petName":"Fiona","image":"160119_finoa.jpg","images":["160119_finoa.jpg"],"description":"This is Fiona. Fiona is a 2 year old, spayed female, DMH Dilute Tortie. Fiona is calm & quiet. She enjoys perching on a window seal and bird watching. She is also good with other cats. She is fully vetted and microchipped too. If you are interested in meeting this precious princess, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-19T05:00:00.000Z","petName":"Bandit","image":"160119_bandit.jpg","images":["160119_bandit.jpg"],"description":"This is Bandit. Bandit is a 1 year old, neutered male, DLH Tux. Bandit is soooooo very affectionate and he loves being held. He is also playful and he like to chase toys. He is good with other cats too. If you are interested in meeting this beautiful kitty, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-20T05:00:00.000Z","Available":true,"petName":"Sofie","image":"160120_sofie.jpg","images":["160120_sofie.jpg"],"description":"Sofie was adopted! And now she is getting all the love & attention she deserves.","notes":""},{"species":"dog","intakeDate":"2016-01-25T05:00:00.000Z","petName":"Whisper","image":"160125_whisper.jpg","images":["160125_whisper.jpg"],"description":"This is Whisper. Whisper is a 2-3 year old, spayed female, Siamese. Whisper is very quiet and easy-going. She is fully vetted and good with other cats too. Whisper loves to be held and petted. She also has beautiful blue eyes! If you are interested in meeting this sweet angel, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-01-28T05:00:00.000Z","Available":true,"petName":"Mickey","image":"160128_mickey.jpg","images":["160128_mickey.jpg"],"description":"Congratulations Mickey! He was adopted and now he is being spoiled and he has someone to cuddle with!","notes":""},{"species":"dog","intakeDate":"2016-02-03T05:00:00.000Z","Available":true,"petName":"Rosie","image":"160203_rosie.jpg","images":["160203_rosie.jpg"],"description":"Rosie found her happy new home. Now Rosie gets all the hugs & kisses she deserves!","notes":""},{"species":"dog","intakeDate":"2016-02-04T05:00:00.000Z","petName":"Bingo","image":"160204_bingo.jpg","images":["160204_bingo.jpg"],"description":"This is Bingo. Bingo is an 8 month old, neutered male, Corgi Mix. Bingo is a snuggle bug! He loves to give kisses and he enjoys belly rubs too. He is also playful and good with other dogs. If you are interested in meeting this Cutie Pie, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-04T05:00:00.000Z","petName":"Barry","image":"160204_barry.jpg","images":["160204_barry.jpg"],"description":"This is Barry. Barry is an 8 month old, neutered male, Corgi Mix. Barry is playful and full of energy. He is also good with other dogs & kids. Barry is fully vetted and looking for his new home. If you are interested in possibly giving this playful puppy his new home, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530. ","notes":""},{"species":"dog","intakeDate":"2016-02-11T05:00:00.000Z","petName":"Olive","image":"160211_olive.jpg","images":["160211_olive.jpg"],"description":"This is Olive. Olive is a 1 year old, spayed female, DSH, Tigerco. Olive is very playful and she loves to chase toys. She is fully vetted and good with other cats too. She has EXTRA toes and a cute NUB tail! If you are interested in meeting this playful kitten, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-12T05:00:00.000Z","petName":"Remi","image":"160212_remi.jpg","images":["160212_remi.jpg"],"description":"This is Remi. Remi is a 10 month old, spayed female, Siamese. This sweet girl loves to give hugs and kisses! She is good with other cats and She has beautiful blue eyes. She is fully vetted and even microchipped! If you are interested in meeting this GORGEOUS gal, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-12T05:00:00.000Z","petName":"Harley","image":"160212_harley.jpg","images":["160212_harley.jpg"],"description":"This is Harley. Harley is a 2-3 year old, spayed female, DSH. She loves to have her ears scratched and she is very affectionate. She is fully vetted and good with other cats too. If your interested in possible giving this adorable kitty a new forever home, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-12T05:00:00.000Z","petName":"Paris","image":"160212_paris.jpg","images":["160212_paris.jpg"],"description":"This is Paris. Paris is a 6-7 year old, spayed female, DSH Dilute Calico. She is quiet and easy-going. She loves to take naps in a warm & soft bed. And she also likes to bird watch. She is fully vetted and front declawed too! If your interested in possible giving this irresistibly lovable kitty a new forever home, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-17T05:00:00.000Z","petName":"Odie","image":"160217_odie.jpg","images":["160217_odie.jpg"],"description":"This is Odie. Odie is a 1 year old, neutered male, Hound Terrier mix. He loves to run and play with other dogs and he also enjoys snuggling up and getting his belly rubbed. He has a wire coat and he is crate trained too. He is only 26 lbs. If you have been looking for a dog that is not too big and not too little, Odie might just be the right one for you! If you would like to meet Odie, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","petName":"Toto","image":"160222_toto.jpg","images":["160222_toto.jpg"],"description":"This is Toto. Toto is a 2 year old, neutered male, Chihuahua. He very affectionate and he loves to be held! He loves to also snuggle in a blanket or on a warm lap. He is good with other dogs and he is crate trained! He is also under 5 lbs! If you are interested in meeting this pocket-sized pup, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","petName":"Mercedes","image":"160222_mercedes.jpg","images":["160222_mercedes.jpg"],"description":"This is Mercedes. Mercedes is a 1 year old, spayed female, Shih Tzu. She is a happy girl! She is quiet but also playful. She is great with other dogs and she is always looking to be by your side. She is fully vetted and crate trained! If you think that Mercedes would make a great addition to your family, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","petName":"Dixie","image":"160222_dixie.jpg","images":["160222_dixie.jpg"],"description":"This is Dixie. Dixie is a 2 year old, neutered male, Chihauhua. He is a LOVE! He is always affectionate and eager to please. He minds well and he loves to cuddle. He is fully vetted and crate trained. He is also good with other dogs. He is under 10 lbs. If you are interested in meeting this cuddle bug, Please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","petName":"Jewel","image":"160222_jewel.jpg","images":["160222_jewel.jpg"],"description":"This is Jewel. Jewel is a 1 year old, spayed female, Chihuahua mix. She is a high energy dog that loves to run and play with other dogs. She is crate trained and she can jump up into your arms! She is also under 10 lbs. If you are interested in possibly giving this high-spirited girl her new home, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","petName":"Bear","image":"160222_bear.jpg","images":["160222_bear.jpg"],"description":"This is Bear. Bear is a 10 month old, neutered male, Corgi Papillon mix. Bear is full of spunk and energy. He is good with other dogs and kids. He is also crate trained. Bear is under 20 lbs. If you are interested in possibly giving this playful pup his new home, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","Available":true,"petName":"Q","image":"160222_q.jpg","images":["160222_q.jpg"],"description":"Q found his new family and now he is getting much needed TLC!","notes":""},{"species":"dog","intakeDate":"2016-02-22T05:00:00.000Z","Available":true,"petName":"Twinkle","image":"160222_twinkle.jpg","images":["160222_twinkle.jpg"],"description":"Another Kitty found her Fur-Ever Home! Now she has a warm lap and soft bed to snuggle in!","notes":""},{"species":"dog","intakeDate":"2016-02-28T05:00:00.000Z","Available":true,"petName":"Hope","image":"160228_hope.jpg","images":["160228_hope.jpg"],"description":"Hope was adopted! Hope found a wonderdul home and a big family to love her. Now she has a huge back yard to play in and kids to spoil her.","notes":""},{"species":"dog","intakeDate":"2016-02-28T05:00:00.000Z","petName":"Max","image":"160228_max.jpg","images":["160228_max.jpg"],"description":"This is Max. Max is a 1-2 year old, neutered male, DLH. Max is very affectionate and big & beautiful! He likes to talk and give hugs. He is also good with other cats too. If you think that Max would make a great additional to your family, please contact your local Lady Lake AnimalDocuments Control at 352-751-1530.","notes":""}]